# Introduction to Pandas
[*pandas*](http://pandas.pydata.org/) is a column-oriented data analysis API.It's a great tool for handling and analyzing input data, and many ML frameworks support *pandas* data structure as input.

Let's import ```pandas``` library

In [1]:
import pandas as pd
import numpy as np
from textblob import TextBlob

C:\Users\ASUS\anaconda3\Lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
print("Pandas Version : ",pd.__version__)

Pandas Version :  2.2.2

The primary data structures in *pandas* are implemented as two classes:
 * **`DataFrame`**, which you can imagine as a relational data table, with rows and named columns.
 * **`Series`**, which is a single column. Each row can be labeled via an index. A DataFrame contains one or more Series and a name for each Series.
 
The data frame is a commonly used common abstraction for data manipulation.Simple implementations exist is spark and R.

In [3]:
from sklearn.datasets import load_diabetes

diabetes = load_diabetes(as_frame=True)
print(type(diabetes["data"]))

<class 'pandas.core.frame.DataFrame'>

In [4]:
?load_diabetes

In [5]:
print(diabetes.DESCR)

.. _diabetes_dataset:

Diabetes dataset
----------------

Ten baseline variables, age, sex, body mass index, average blood
pressure, and six blood serum measurements were obtained for each of n =
442 diabetes patients, as well as the response of interest, a
quantitative measure of disease progression one year after baseline.

**Data Set Characteristics:**

:Number of Instances: 442

:Number of Attributes: First 10 columns are numeric predictive values

:Target: Column 11 is a quantitative measure of disease progression one year after baseline

:Attribute Information:
    - age     age in years
    - sex
    - bmi     body mass index
    - bp      average blood pressure
    - s1      tc, total serum cholesterol
    - s2      ldl, low-density lipoproteins
    - s3      hdl, high-density lipoproteins
    - s4      tch, total cholesterol / HDL
    - s5      ltg, possibly log of serum triglycerides level
    - s6      glu, blood sugar level

Note: Each of these 10 feature variables have been mean centered and scaled by the standard deviation times the square root of `n_samples` (i.e. the sum of squares of each column totals 1).

Source URL:
https://www4.stat.ncsu.edu/~boos/var.select/diabetes.html

For more information see:
Bradley Efron, Trevor Hastie, Iain Johnstone and Robert Tibshirani (2004) "Least Angle Regression," Annals of Statistics (with discussion), 407-499.
(https://web.stanford.edu/~hastie/Papers/LARS/LeastAngle_2002.pdf)

In [6]:
df = diabetes["data"]

## Creating pandas dataframe from series

In [7]:
cities = pd.Series(["Mumbai","Bangalore","Chennai","Delhi"])
population = pd.Series([17000000,13000000,6000000])

In [8]:
city_info_df = pd.DataFrame({"City":cities,"Population":population})

In [9]:
type(city_info_df)

pandas.core.frame.DataFrame

In [10]:
city_info_df

        City  Population
0     Mumbai  17000000.0
1  Bangalore  13000000.0
2    Chennai   6000000.0
3      Delhi         NaN

## Exploring data in dataframe

Find out the number of rows and columns in the dataframe.

In [11]:
df.shape

(442, 10)

Name of the columns

In [12]:
df.columns

Index(['age', 'sex', 'bmi', 'bp', 's1', 's2', 's3', 's4', 's5', 's6'], dtype='object')

In [13]:
list(df.columns)

['age', 'sex', 'bmi', 'bp', 's1', 's2', 's3', 's4', 's5', 's6']

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 442 entries, 0 to 441
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     442 non-null    float64
 1   sex     442 non-null    float64
 2   bmi     442 non-null    float64
 3   bp      442 non-null    float64
 4   s1      442 non-null    float64
 5   s2      442 non-null    float64
 6   s3      442 non-null    float64
 7   s4      442 non-null    float64
 8   s5      442 non-null    float64
 9   s6      442 non-null    float64
dtypes: float64(10)
memory usage: 34.7 KB

Quickly examine a few entries in the dataframe.Say first 5 and last 5.

In [15]:
? df.head

In [16]:
df.head()

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019907,-0.017646
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068332,-0.092204
2,0.085299,0.050680,0.044451,-0.005670,-0.045599,-0.034194,-0.032356,-0.002592,0.002861,-0.025930
3,-0.089063,-0.044642,-0.011595,-0.036656,0.012191,0.024991,-0.036038,0.034309,0.022688,-0.009362
4,0.005383,-0.044642,-0.036385,0.021872,0.003935,0.015596,0.008142,-0.002592,-0.031988,-0.046641

In [17]:
df.tail()

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
437,0.041708,0.050680,0.019662,0.059744,-0.005697,-0.002566,-0.028674,-0.002592,0.031193,0.007207
438,-0.005515,0.050680,-0.015906,-0.067642,0.049341,0.079165,-0.028674,0.034309,-0.018114,0.044485
439,0.041708,0.050680,-0.015906,0.017293,-0.037344,-0.013840,-0.024993,-0.011080,-0.046883,0.015491
440,-0.045472,-0.044642,0.039062,0.001215,0.016318,0.015283,-0.028674,0.026560,0.044529,-0.025930
441,-0.045472,-0.044642,-0.073030,-0.081413,0.083740,0.027809,0.173816,-0.039493,-0.004222,0.003064

Let's get summary statistics on the dataframe

In [18]:
df.describe()

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
count,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02
mean,-2.511817e-19,1.230790e-17,-2.245564e-16,-4.797570e-17,-1.381499e-17,3.918434e-17,-5.777179e-18,-9.042540e-18,9.293722e-17,1.130318e-17
std,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02
min,-1.072256e-01,-4.464164e-02,-9.027530e-02,-1.123988e-01,-1.267807e-01,-1.156131e-01,-1.023071e-01,-7.639450e-02,-1.260971e-01,-1.377672e-01
25%,-3.729927e-02,-4.464164e-02,-3.422907e-02,-3.665608e-02,-3.424784e-02,-3.035840e-02,-3.511716e-02,-3.949338e-02,-3.324559e-02,-3.317903e-02
50%,5.383060e-03,-4.464164e-02,-7.283766e-03,-5.670422e-03,-4.320866e-03,-3.819065e-03,-6.584468e-03,-2.592262e-03,-1.947171e-03,-1.077698e-03
75%,3.807591e-02,5.068012e-02,3.124802e-02,3.564379e-02,2.835801e-02,2.984439e-02,2.931150e-02,3.430886e-02,3.243232e-02,2.791705e-02
max,1.107267e-01,5.068012e-02,1.705552e-01,1.320436e-01,1.539137e-01,1.987880e-01,1.811791e-01,1.852344e-01,1.335973e-01,1.356118e-01

In [19]:
df.describe(percentiles=[0.2,0.6,0.8])

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
count,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02,4.420000e+02
mean,-2.511817e-19,1.230790e-17,-2.245564e-16,-4.797570e-17,-1.381499e-17,3.918434e-17,-5.777179e-18,-9.042540e-18,9.293722e-17,1.130318e-17
std,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02,4.761905e-02
min,-1.072256e-01,-4.464164e-02,-9.027530e-02,-1.123988e-01,-1.267807e-01,-1.156131e-01,-1.023071e-01,-7.639450e-02,-1.260971e-01,-1.377672e-01
20%,-4.547248e-02,-4.464164e-02,-4.048038e-02,-4.009893e-02,-3.871969e-02,-3.695017e-02,-3.971921e-02,-3.949338e-02,-4.117617e-02,-3.835666e-02
50%,5.383060e-03,-4.464164e-02,-7.283766e-03,-5.670422e-03,-4.320866e-03,-3.819065e-03,-6.584468e-03,-2.592262e-03,-1.947171e-03,-1.077698e-03
60%,1.628068e-02,5.068012e-02,5.218854e-03,8.100982e-03,8.062710e-03,8.706873e-03,8.142084e-03,-2.592262e-03,1.255119e-02,7.206516e-03
80%,4.170844e-02,5.068012e-02,4.229559e-02,4.941519e-02,3.943444e-02,3.952068e-02,3.759519e-02,3.430886e-02,3.885335e-02,3.620126e-02
max,1.107267e-01,5.068012e-02,1.705552e-01,1.320436e-01,1.539137e-01,1.987880e-01,1.811791e-01,1.852344e-01,1.335973e-01,1.356118e-01

In [20]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
age,442.0,-2.511817e-19,0.047619,-0.107226,-0.037299,0.005383,0.038076,0.110727
sex,442.0,1.230790e-17,0.047619,-0.044642,-0.044642,-0.044642,0.050680,0.050680
bmi,442.0,-2.245564e-16,0.047619,-0.090275,-0.034229,-0.007284,0.031248,0.170555
bp,442.0,-4.797570e-17,0.047619,-0.112399,-0.036656,-0.005670,0.035644,0.132044
s1,442.0,-1.381499e-17,0.047619,-0.126781,-0.034248,-0.004321,0.028358,0.153914
s2,442.0,3.918434e-17,0.047619,-0.115613,-0.030358,-0.003819,0.029844,0.198788
s3,442.0,-5.777179e-18,0.047619,-0.102307,-0.035117,-0.006584,0.029312,0.181179
s4,442.0,-9.042540e-18,0.047619,-0.076395,-0.039493,-0.002592,0.034309,0.185234
s5,442.0,9.293722e-17,0.047619,-0.126097,-0.033246,-0.001947,0.032432,0.133597
s6,442.0,1.130318e-17,0.047619,-0.137767,-0.033179,-0.001078,0.027917,0.135612

## Selection

In [21]:
df["age"]

0      0.038076
1     -0.001882
2      0.085299
3     -0.089063
4      0.005383
         ...
437    0.041708
438   -0.005515
439    0.041708
440   -0.045472
441   -0.045472
Name: age, Length: 442, dtype: float64

In [22]:
type(df["age"])

pandas.core.series.Series

In [23]:
df["age"][0]

0.038075906433423026

In [24]:
df["age"][:5]

0    0.038076
1   -0.001882
2    0.085299
3   -0.089063
4    0.005383
Name: age, dtype: float64

In [25]:
df["age"][-5:]

437    0.041708
438   -0.005515
439    0.041708
440   -0.045472
441   -0.045472
Name: age, dtype: float64

In [26]:
df["age"][100:200]

100    0.016281
101    0.016281
102   -0.092695
103    0.059871
104   -0.027310
         ...
195    0.027178
196   -0.023677
197    0.048974
198   -0.052738
199    0.041708
Name: age, Length: 100, dtype: float64

In [27]:
df[["age","sex"]]

          age       sex
0    0.038076  0.050680
1   -0.001882 -0.044642
2    0.085299  0.050680
3   -0.089063 -0.044642
4    0.005383 -0.044642
..        ...       ...
437  0.041708  0.050680
438 -0.005515  0.050680
439  0.041708  0.050680
440 -0.045472 -0.044642
441 -0.045472 -0.044642

[442 rows x 2 columns]

In [28]:
df[["age","sex"]][:5]

        age       sex
0  0.038076  0.050680
1 -0.001882 -0.044642
2  0.085299  0.050680
3 -0.089063 -0.044642
4  0.005383 -0.044642

In [29]:
df[["age","sex"]][-5:]

          age       sex
437  0.041708  0.050680
438 -0.005515  0.050680
439  0.041708  0.050680
440 -0.045472 -0.044642
441 -0.045472 -0.044642

* loc
* iloc

In [30]:
df.iloc[441]

age   -0.045472
sex   -0.044642
bmi   -0.073030
bp    -0.081413
s1     0.083740
s2     0.027809
s3     0.173816
s4    -0.039493
s5    -0.004222
s6     0.003064
Name: 441, dtype: float64

In [31]:
df.iloc[0]

age    0.038076
sex    0.050680
bmi    0.061696
bp     0.021872
s1    -0.044223
s2    -0.034821
s3    -0.043401
s4    -0.002592
s5     0.019907
s6    -0.017646
Name: 0, dtype: float64

In [32]:
df.loc[0]

age    0.038076
sex    0.050680
bmi    0.061696
bp     0.021872
s1    -0.044223
s2    -0.034821
s3    -0.043401
s4    -0.002592
s5     0.019907
s6    -0.017646
Name: 0, dtype: float64

In [33]:
df.loc[4,"age"]

0.005383060374248237

In [34]:
df.loc[4,["age","sex"]]

age    0.005383
sex   -0.044642
Name: 4, dtype: float64

In [35]:
df.iloc[4,[1,5,7,9]]

sex   -0.044642
s2     0.015596
s4    -0.002592
s6    -0.046641
Name: 4, dtype: float64

In [36]:
row_conditions_met = df.age > 5.383060e-03

In [37]:
df.loc[row_conditions_met]

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019907,-0.017646
2,0.085299,0.050680,0.044451,-0.005670,-0.045599,-0.034194,-0.032356,-0.002592,0.002861,-0.025930
4,0.005383,-0.044642,-0.036385,0.021872,0.003935,0.015596,0.008142,-0.002592,-0.031988,-0.046641
7,0.063504,0.050680,-0.001895,0.066629,0.090620,0.108914,0.022869,0.017703,-0.035816,0.003064
8,0.041708,0.050680,0.061696,-0.040099,-0.013953,0.006202,-0.028674,-0.002592,-0.014960,0.011349
...,...,...,...,...,...,...,...,...,...,...
431,0.070769,0.050680,-0.030996,0.021872,-0.037344,-0.047034,0.033914,-0.039493,-0.014960,-0.001078
432,0.009016,-0.044642,0.055229,-0.005670,0.057597,0.044719,-0.002903,0.023239,0.055686,0.106617
434,0.016281,-0.044642,0.001339,0.008101,0.005311,0.010899,0.030232,-0.039493,-0.045424,0.032059
437,0.041708,0.050680,0.019662,0.059744,-0.005697,-0.002566,-0.028674,-0.002592,0.031193,0.007207
439,0.041708,0.050680,-0.015906,0.017293,-0.037344,-0.013840,-0.024993,-0.011080,-0.046883,0.015491

In [38]:
df.loc[df.age > 5.383060e-03]

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019907,-0.017646
2,0.085299,0.050680,0.044451,-0.005670,-0.045599,-0.034194,-0.032356,-0.002592,0.002861,-0.025930
4,0.005383,-0.044642,-0.036385,0.021872,0.003935,0.015596,0.008142,-0.002592,-0.031988,-0.046641
7,0.063504,0.050680,-0.001895,0.066629,0.090620,0.108914,0.022869,0.017703,-0.035816,0.003064
8,0.041708,0.050680,0.061696,-0.040099,-0.013953,0.006202,-0.028674,-0.002592,-0.014960,0.011349
...,...,...,...,...,...,...,...,...,...,...
431,0.070769,0.050680,-0.030996,0.021872,-0.037344,-0.047034,0.033914,-0.039493,-0.014960,-0.001078
432,0.009016,-0.044642,0.055229,-0.005670,0.057597,0.044719,-0.002903,0.023239,0.055686,0.106617
434,0.016281,-0.044642,0.001339,0.008101,0.005311,0.010899,0.030232,-0.039493,-0.045424,0.032059
437,0.041708,0.050680,0.019662,0.059744,-0.005697,-0.002566,-0.028674,-0.002592,0.031193,0.007207
439,0.041708,0.050680,-0.015906,0.017293,-0.037344,-0.013840,-0.024993,-0.011080,-0.046883,0.015491

In [39]:
age_df_temp = df.loc[df.age < 5.383060e-03]

In [40]:
age_df_temp = df[df.age < 5.383060e-03]

In [41]:
age_df_temp.iloc[2]

age   -0.092695
sex   -0.044642
bmi   -0.040696
bp    -0.019442
s1    -0.068991
s2    -0.079288
s3     0.041277
s4    -0.076395
s5    -0.041176
s6    -0.096346
Name: 5, dtype: float64

In [42]:
age_df_temp.iloc[1]

age   -0.089063
sex   -0.044642
bmi   -0.011595
bp    -0.036656
s1     0.012191
s2     0.024991
s3    -0.036038
s4     0.034309
s5     0.022688
s6    -0.009362
Name: 3, dtype: float64

In [43]:
age_df_temp = df.loc[(df.age < 5.383060e-03) & (df.sex > -4.464164e-02)]

In [44]:
age_df_temp.shape

(214, 10)

In [45]:
another_df = pd.DataFrame(np.random.rand(100,4),index=range(10,110),columns=list("ABCD"))

In [46]:
another_df.head()

           A         B         C         D
10  0.629736  0.496812  0.537075  0.892206
11  0.653070  0.494680  0.988615  0.900284
12  0.621110  0.338209  0.748794  0.476407
13  0.218984  0.506596  0.458413  0.050306
14  0.616715  0.559104  0.011708  0.778805

In [47]:
another_df.tail()

            A         B         C         D
105  0.554279  0.189217  0.413295  0.100523
106  0.077615  0.946503  0.414424  0.819756
107  0.891108  0.230109  0.259210  0.232938
108  0.019531  0.900690  0.064298  0.851255
109  0.580491  0.038972  0.936041  0.352150

In [48]:
df = pd.DataFrame(np.random.rand(9,4),index=list("abcdefghi"),columns=list("ABCD"))

In [49]:
df.shape

(9, 4)

In [50]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, a to i
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       9 non-null      float64
 1   B       9 non-null      float64
 2   C       9 non-null      float64
 3   D       9 non-null      float64
dtypes: float64(4)
memory usage: 360.0+ bytes

In [52]:
df.head()

          A         B         C         D
a  0.648890  0.297853  0.865321  0.135309
b  0.859188  0.698994  0.811888  0.065638
c  0.162187  0.497991  0.591337  0.467226
d  0.396985  0.917962  0.561148  0.603864
e  0.047729  0.533211  0.454251  0.481114

In [53]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i'], dtype='object')

In [54]:
df.loc['a']

A    0.648890
B    0.297853
C    0.865321
D    0.135309
Name: a, dtype: float64

In [55]:
df.loc['a','A':'D']

A    0.648890
B    0.297853
C    0.865321
D    0.135309
Name: a, dtype: float64

In [56]:
df.loc['a':'d',:]

          A         B         C         D
a  0.648890  0.297853  0.865321  0.135309
b  0.859188  0.698994  0.811888  0.065638
c  0.162187  0.497991  0.591337  0.467226
d  0.396985  0.917962  0.561148  0.603864

In [57]:
df.iloc[:4,0:3]

          A         B         C
a  0.648890  0.297853  0.865321
b  0.859188  0.698994  0.811888
c  0.162187  0.497991  0.591337
d  0.396985  0.917962  0.561148

In [58]:
df.iloc[:4,1:3]

          B         C
a  0.297853  0.865321
b  0.698994  0.811888
c  0.497991  0.591337
d  0.917962  0.561148

In [59]:
df.iloc[0:4,:]

          A         B         C         D
a  0.648890  0.297853  0.865321  0.135309
b  0.859188  0.698994  0.811888  0.065638
c  0.162187  0.497991  0.591337  0.467226
d  0.396985  0.917962  0.561148  0.603864

In [60]:
df.iloc[0:4]

          A         B         C         D
a  0.648890  0.297853  0.865321  0.135309
b  0.859188  0.698994  0.811888  0.065638
c  0.162187  0.497991  0.591337  0.467226
d  0.396985  0.917962  0.561148  0.603864

In [61]:
df.iloc[:,1]

a    0.297853
b    0.698994
c    0.497991
d    0.917962
e    0.533211
f    0.002531
g    0.714178
h    0.606367
i    0.994767
Name: B, dtype: float64

In [62]:
selector = lambda df:df['A'] > 0

In [63]:
df.loc[selector]

          A         B         C         D
a  0.648890  0.297853  0.865321  0.135309
b  0.859188  0.698994  0.811888  0.065638
c  0.162187  0.497991  0.591337  0.467226
d  0.396985  0.917962  0.561148  0.603864
e  0.047729  0.533211  0.454251  0.481114
f  0.493856  0.002531  0.169714  0.034338
g  0.361638  0.714178  0.637812  0.741574
h  0.503260  0.606367  0.819930  0.070676
i  0.828112  0.994767  0.565624  0.313292

In [64]:
selector = lambda df:df["A"] > 0.5

In [65]:
df.loc[selector]

          A         B         C         D
a  0.648890  0.297853  0.865321  0.135309
b  0.859188  0.698994  0.811888  0.065638
h  0.503260  0.606367  0.819930  0.070676
i  0.828112  0.994767  0.565624  0.313292

In [66]:
condition_for_selection = lambda df : (df["A"] > 0.5) & (df["B"] < 0.4)

In [67]:
df.loc[condition_for_selection]

         A         B         C         D
a  0.64889  0.297853  0.865321  0.135309

In [68]:
df[condition_for_selection]

         A         B         C         D
a  0.64889  0.297853  0.865321  0.135309

In [69]:
condition_for_selection = (df["A"] > 0.5) | ~(df["B"] < 0.2)

In [70]:
df[condition_for_selection]

          A         B         C         D
a  0.648890  0.297853  0.865321  0.135309
b  0.859188  0.698994  0.811888  0.065638
c  0.162187  0.497991  0.591337  0.467226
d  0.396985  0.917962  0.561148  0.603864
e  0.047729  0.533211  0.454251  0.481114
g  0.361638  0.714178  0.637812  0.741574
h  0.503260  0.606367  0.819930  0.070676
i  0.828112  0.994767  0.565624  0.313292

## Adding a column in the dataframe

In [71]:
df["E"] = df["A"] * 100
df

          A         B         C         D          E
a  0.648890  0.297853  0.865321  0.135309  64.889036
b  0.859188  0.698994  0.811888  0.065638  85.918831
c  0.162187  0.497991  0.591337  0.467226  16.218707
d  0.396985  0.917962  0.561148  0.603864  39.698512
e  0.047729  0.533211  0.454251  0.481114   4.772925
f  0.493856  0.002531  0.169714  0.034338  49.385611
g  0.361638  0.714178  0.637812  0.741574  36.163817
h  0.503260  0.606367  0.819930  0.070676  50.325951
i  0.828112  0.994767  0.565624  0.313292  82.811242

In [72]:
df["F"] = df["A"] + df["C"]
df

          A         B         C         D          E         F
a  0.648890  0.297853  0.865321  0.135309  64.889036  1.514211
b  0.859188  0.698994  0.811888  0.065638  85.918831  1.671076
c  0.162187  0.497991  0.591337  0.467226  16.218707  0.753524
d  0.396985  0.917962  0.561148  0.603864  39.698512  0.958133
e  0.047729  0.533211  0.454251  0.481114   4.772925  0.501980
f  0.493856  0.002531  0.169714  0.034338  49.385611  0.663570
g  0.361638  0.714178  0.637812  0.741574  36.163817  0.999450
h  0.503260  0.606367  0.819930  0.070676  50.325951  1.323190
i  0.828112  0.994767  0.565624  0.313292  82.811242  1.393737

In [73]:
criteria = df["A"] < 0.2

In [74]:
df.loc[criteria,"A"] = 0
df

          A         B         C         D          E         F
a  0.648890  0.297853  0.865321  0.135309  64.889036  1.514211
b  0.859188  0.698994  0.811888  0.065638  85.918831  1.671076
c  0.000000  0.497991  0.591337  0.467226  16.218707  0.753524
d  0.396985  0.917962  0.561148  0.603864  39.698512  0.958133
e  0.000000  0.533211  0.454251  0.481114   4.772925  0.501980
f  0.493856  0.002531  0.169714  0.034338  49.385611  0.663570
g  0.361638  0.714178  0.637812  0.741574  36.163817  0.999450
h  0.503260  0.606367  0.819930  0.070676  50.325951  1.323190
i  0.828112  0.994767  0.565624  0.313292  82.811242  1.393737

In [75]:
cities = ["Mumbai","Delhi","Chennai","Kolkata","Bengalure","Hyderabad","Pune","Ahmedabad","Indore"]

In [76]:
df["city"] = cities
df

          A         B         C         D          E         F       city
a  0.648890  0.297853  0.865321  0.135309  64.889036  1.514211     Mumbai
b  0.859188  0.698994  0.811888  0.065638  85.918831  1.671076      Delhi
c  0.000000  0.497991  0.591337  0.467226  16.218707  0.753524    Chennai
d  0.396985  0.917962  0.561148  0.603864  39.698512  0.958133    Kolkata
e  0.000000  0.533211  0.454251  0.481114   4.772925  0.501980  Bengalure
f  0.493856  0.002531  0.169714  0.034338  49.385611  0.663570  Hyderabad
g  0.361638  0.714178  0.637812  0.741574  36.163817  0.999450       Pune
h  0.503260  0.606367  0.819930  0.070676  50.325951  1.323190  Ahmedabad
i  0.828112  0.994767  0.565624  0.313292  82.811242  1.393737     Indore

In [77]:
df_copy = df.copy()
df

          A         B         C         D          E         F       city
a  0.648890  0.297853  0.865321  0.135309  64.889036  1.514211     Mumbai
b  0.859188  0.698994  0.811888  0.065638  85.918831  1.671076      Delhi
c  0.000000  0.497991  0.591337  0.467226  16.218707  0.753524    Chennai
d  0.396985  0.917962  0.561148  0.603864  39.698512  0.958133    Kolkata
e  0.000000  0.533211  0.454251  0.481114   4.772925  0.501980  Bengalure
f  0.493856  0.002531  0.169714  0.034338  49.385611  0.663570  Hyderabad
g  0.361638  0.714178  0.637812  0.741574  36.163817  0.999450       Pune
h  0.503260  0.606367  0.819930  0.070676  50.325951  1.323190  Ahmedabad
i  0.828112  0.994767  0.565624  0.313292  82.811242  1.393737     Indore

In [78]:
cities_new = ["Mumbai","Delhi","Chennai","Kolkata","Bengalure","Hyderabad","Pune","Ahmedabad","Guwahati"]

In [79]:
df_copy["new_city"] = cities_new
df_copy

,A,B,C,D,E,F,city,new_city
a,0.648890,0.297853,0.865321,0.135309,64.889036,1.514211,Mumbai,Mumbai
b,0.859188,0.698994,0.811888,0.065638,85.918831,1.671076,Delhi,Delhi
c,0.000000,0.497991,0.591337,0.467226,16.218707,0.753524,Chennai,Chennai
d,0.396985,0.917962,0.561148,0.603864,39.698512,0.958133,Kolkata,Kolkata
e,0.000000,0.533211,0.454251,0.481114,4.772925,0.501980,Bengalure,Bengalure
f,0.493856,0.002531,0.169714,0.034338,49.385611,0.663570,Hyderabad,Hyderabad
g,0.361638,0.714178,0.637812,0.741574,36.163817,0.999450,Pune,Pune
h,0.503260,0.606367,0.819930,0.070676,50.325951,1.323190,Ahmedabad,Ahmedabad
i,0.828112,0.994767,0.565624,0.313292,82.811242,1.393737,Indore,Guwahati

In [80]:
criteria = df_copy["city"].isin(["Pune","Bengaluru","Hyderabad"])

In [81]:
df_copy.loc[df.city=="Bengalure",["city","new_city"]] = "Bengaluru"
df_copy

,A,B,C,D,E,F,city,new_city
a,0.648890,0.297853,0.865321,0.135309,64.889036,1.514211,Mumbai,Mumbai
b,0.859188,0.698994,0.811888,0.065638,85.918831,1.671076,Delhi,Delhi
c,0.000000,0.497991,0.591337,0.467226,16.218707,0.753524,Chennai,Chennai
d,0.396985,0.917962,0.561148,0.603864,39.698512,0.958133,Kolkata,Kolkata
e,0.000000,0.533211,0.454251,0.481114,4.772925,0.501980,Bengaluru,Bengaluru
f,0.493856,0.002531,0.169714,0.034338,49.385611,0.663570,Hyderabad,Hyderabad
g,0.361638,0.714178,0.637812,0.741574,36.163817,0.999450,Pune,Pune
h,0.503260,0.606367,0.819930,0.070676,50.325951,1.323190,Ahmedabad,Ahmedabad
i,0.828112,0.994767,0.565624,0.313292,82.811242,1.393737,Indore,Guwahati

In [82]:
df_copy.drop(["new_city"],axis=1)

          A         B         C         D          E         F       city
a  0.648890  0.297853  0.865321  0.135309  64.889036  1.514211     Mumbai
b  0.859188  0.698994  0.811888  0.065638  85.918831  1.671076      Delhi
c  0.000000  0.497991  0.591337  0.467226  16.218707  0.753524    Chennai
d  0.396985  0.917962  0.561148  0.603864  39.698512  0.958133    Kolkata
e  0.000000  0.533211  0.454251  0.481114   4.772925  0.501980  Bengaluru
f  0.493856  0.002531  0.169714  0.034338  49.385611  0.663570  Hyderabad
g  0.361638  0.714178  0.637812  0.741574  36.163817  0.999450       Pune
h  0.503260  0.606367  0.819930  0.070676  50.325951  1.323190  Ahmedabad
i  0.828112  0.994767  0.565624  0.313292  82.811242  1.393737     Indore

In [83]:
df_copy.loc[:,"city"] = "Chennai"

In [84]:
df_copy = df_copy.drop(['city'],axis=1)

In [85]:
?df_copy.sample

In [86]:
df_copy.sample(3)

          A         B         C         D          E         F   new_city
h  0.503260  0.606367  0.819930  0.070676  50.325951  1.323190  Ahmedabad
b  0.859188  0.698994  0.811888  0.065638  85.918831  1.671076      Delhi
i  0.828112  0.994767  0.565624  0.313292  82.811242  1.393737   Guwahati

In [87]:
df_copy.sample(3,random_state=42)

          A         B         C         D          E         F   new_city
h  0.503260  0.606367  0.819930  0.070676  50.325951  1.323190  Ahmedabad
b  0.859188  0.698994  0.811888  0.065638  85.918831  1.671076      Delhi
f  0.493856  0.002531  0.169714  0.034338  49.385611  0.663570  Hyderabad

In [88]:
df_copy.sample(3,random_state=42)

          A         B         C         D          E         F   new_city
h  0.503260  0.606367  0.819930  0.070676  50.325951  1.323190  Ahmedabad
b  0.859188  0.698994  0.811888  0.065638  85.918831  1.671076      Delhi
f  0.493856  0.002531  0.169714  0.034338  49.385611  0.663570  Hyderabad

In [89]:
df_copy.sample(3,random_state=42,replace=True)

          A         B         C         D          E         F   new_city
g  0.361638  0.714178  0.637812  0.741574  36.163817  0.999450       Pune
d  0.396985  0.917962  0.561148  0.603864  39.698512  0.958133    Kolkata
h  0.503260  0.606367  0.819930  0.070676  50.325951  1.323190  Ahmedabad

In [90]:
cities = ["Mumbai","Chennai","Pune","Ahmedabad","Kolkata","Kanpur","Delhi"]
city_df = pd.DataFrame(cities)
city_df

           0
0     Mumbai
1    Chennai
2       Pune
3  Ahmedabad
4    Kolkata
5     Kanpur
6      Delhi

In [91]:
city_df.columns = ["City_Name"]
city_df

   City_Name
0     Mumbai
1    Chennai
2       Pune
3  Ahmedabad
4    Kolkata
5     Kanpur
6      Delhi

In [92]:
condition_met = city_df.City_Name == "Mumbai"
type(condition_met)

pandas.core.series.Series

In [93]:
city_df[condition_met]

  City_Name
0    Mumbai

In [94]:
city_df[city_df.City_Name=="Pune"]

  City_Name
2      Pune

## Aggregation and Grouping

In [95]:
random_state = np.random.RandomState(100)
random_series = pd.Series(random_state.rand(10))
random_series

0    0.543405
1    0.278369
2    0.424518
3    0.844776
4    0.004719
5    0.121569
6    0.670749
7    0.825853
8    0.136707
9    0.575093
dtype: float64

Now that the series is created, we can try aggregation functions like `mean`, `std` etc

In [96]:
random_series.mean()

0.4425757785871915

In [97]:
random_series.sum()

4.425757785871915

Let's create a dataframe with 5 rows and 2 columns containing random numbers.

In [98]:
df = pd.DataFrame({
    "A" : random_state.rand(5),
    "B" : random_state.rand(5)
})
df

          A         B
0  0.891322  0.978624
1  0.209202  0.811683
2  0.185328  0.171941
3  0.108377  0.816225
4  0.219697  0.274074

In [99]:
df.sum()

A    1.613927
B    3.052546
dtype: float64

Try these operations row-wise

In [100]:
df.mean(axis=1)

0    0.934973
1    0.510443
2    0.178635
3    0.462301
4    0.246886
dtype: float64

In [101]:
df.sum(axis=1)

0    1.869946
1    1.020885
2    0.357269
3    0.924602
4    0.493771
dtype: float64

## GroupBy

Three Stages 
* Split - we split dataframe into multiple smaller dataframe based on the values of keys
* Apply - we apply desired aggregation/transformation on each dataframe.
* Combine - we combine results from apply state into a dataframe

In [102]:
df = pd.DataFrame({'key' : ["A","B","C"]*2,"data":range(6)})
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [103]:
df.groupby("key").sum()

     data
key
A       3
B       5
C       7

## Apply and Map

In [104]:
students = pd.Series(data = [180,175,168,190],index=["A","B","C","D"])
print(type(students))

<class 'pandas.core.series.Series'>

In [105]:
def cm_to_feet(h):
    return np.round(h/30.48,2)

In [106]:
students.apply(cm_to_feet)

A    5.91
B    5.74
C    5.51
D    6.23
dtype: float64

In [107]:
data1 = pd.DataFrame({'EmployeeName': ['Callen Dunkley', 'Sarah Rayner', 'Jeanette Sloan', 'Kaycee Acosta', 'Henri Conroy', 'Emma Peralta', 'Martin Butt', 'Alex Jensen', 'Kim Howarth', 'Jane Burnett'],
                    'Department': ['Accounting', 'Engineering', 'Engineering', 'HR', 'HR', 'HR', 'Data Science', 'Data Science', 'Accounting', 'Data Science'],
                    'HireDate': [2010, 2018, 2012, 2014, 2014, 2018, 2020, 2018, 2020, 2012],
                    'Sex': ['M', 'F', 'F', 'F', 'M', 'F', 'M', 'M', 'M', 'F'],
                    'Birthdate': ['04/09/1982', '14/04/1981', '06/05/1997', '08/01/1986', '10/10/1988', '12/11/1992', '10/04/1991', '16/07/1995', '08/10/1992', '11/10/1979'],
                    'Weight': [78, 80, 66, 67, 90, 57, 115, 87, 95, 57],
                    'Height': [176, 160, 169, 157, 185, 164, 195, 180, 174, 165],
                    'Kids': [2, 1, 0, 1, 1, 0, 2, 0, 3, 1]
                    })
data1

,EmployeeName,Department,HireDate,Sex,Birthdate,Weight,Height,Kids
0,Callen Dunkley,Accounting,2010,M,04/09/1982,78,176,2
1,Sarah Rayner,Engineering,2018,F,14/04/1981,80,160,1
2,Jeanette Sloan,Engineering,2012,F,06/05/1997,66,169,0
3,Kaycee Acosta,HR,2014,F,08/01/1986,67,157,1
4,Henri Conroy,HR,2014,M,10/10/1988,90,185,1
5,Emma Peralta,HR,2018,F,12/11/1992,57,164,0
6,Martin Butt,Data Science,2020,M,10/04/1991,115,195,2
7,Alex Jensen,Data Science,2018,M,16/07/1995,87,180,0
8,Kim Howarth,Accounting,2020,M,08/10/1992,95,174,3
9,Jane Burnett,Data Science,2012,F,11/10/1979,57,165,1

In [108]:
def first_name(s):
    return s.split()[0]

In [109]:
def last_name(s):
    return s.split()[1]

In [110]:
data1["first_name"] = data1["EmployeeName"].apply(first_name)
data1["last_name"] = data1["EmployeeName"].apply(last_name)
data1

,EmployeeName,Department,HireDate,Sex,Birthdate,Weight,Height,Kids,first_name,last_name
0,Callen Dunkley,Accounting,2010,M,04/09/1982,78,176,2,Callen,Dunkley
1,Sarah Rayner,Engineering,2018,F,14/04/1981,80,160,1,Sarah,Rayner
2,Jeanette Sloan,Engineering,2012,F,06/05/1997,66,169,0,Jeanette,Sloan
3,Kaycee Acosta,HR,2014,F,08/01/1986,67,157,1,Kaycee,Acosta
4,Henri Conroy,HR,2014,M,10/10/1988,90,185,1,Henri,Conroy
5,Emma Peralta,HR,2018,F,12/11/1992,57,164,0,Emma,Peralta
6,Martin Butt,Data Science,2020,M,10/04/1991,115,195,2,Martin,Butt
7,Alex Jensen,Data Science,2018,M,16/07/1995,87,180,0,Alex,Jensen
8,Kim Howarth,Accounting,2020,M,08/10/1992,95,174,3,Kim,Howarth
9,Jane Burnett,Data Science,2012,F,11/10/1979,57,165,1,Jane,Burnett

In [111]:
airline_series = pd.Series(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet', 'Vistara'])
duration_series = pd.Series(['2h 5m', '2h', '50m', '1h 30m', '3h 20m'])
arrival_time_series = pd.Series(['21:45', '10:00', '00:50', '15:30', '19:15'])
departure_time_series = pd.Series(['19:40', '07:55', '00:44', '14:00', '15:55'])
distance_series = pd.Series([2050, 2000, 220, 800, 3000])

df = pd.DataFrame({
    'Airline': airline_series,
    'Duration': duration_series,
    'Arrival Time': arrival_time_series,
    'Departure Time': departure_time_series,
    'Distance (km)': distance_series
})

df

       Airline Duration Arrival Time Departure Time  Distance (km)
0       IndiGo    2h 5m        21:45          19:40           2050
1    Air India       2h        10:00          07:55           2000
2  Jet Airways      50m        00:50          00:44            220
3     SpiceJet   1h 30m        15:30          14:00            800
4      Vistara   3h 20m        19:15          15:55           3000

In [112]:
def duration_min(s):
    min = 0
    a = s.split(" ")
    for i in range(len(a)):
        if "h" in a[i]:
            min += int(a[i][:-1])*60
            
        if "m" in a[i]:
            min += int(a[i][:-1])
    return min

In [113]:
df["Duration"] = df["Duration"].apply(duration_min)
df

       Airline  Duration Arrival Time Departure Time  Distance (km)
0       IndiGo       125        21:45          19:40           2050
1    Air India       120        10:00          07:55           2000
2  Jet Airways        50        00:50          00:44            220
3     SpiceJet        90        15:30          14:00            800
4      Vistara       200        19:15          15:55           3000

In [114]:
def hr(time):
    time = time.split(":")
    hour = int(time[0])
    if(hour >= 5 and hour < 12):
        return "Morning"
    if(hour >= 12 and hour < 17):
        return "Afternoon"
    if(hour >= 17 and hour < 20):
        return "Evening"
    if(hour >= 20 or hour < 5):
        return "Night"

In [115]:
df["Shift"] = df["Arrival Time"].apply(hr)
df

       Airline  Duration Arrival Time Departure Time  Distance (km)      Shift
0       IndiGo       125        21:45          19:40           2050      Night
1    Air India       120        10:00          07:55           2000    Morning
2  Jet Airways        50        00:50          00:44            220      Night
3     SpiceJet        90        15:30          14:00            800  Afternoon
4      Vistara       200        19:15          15:55           3000    Evening

In [116]:
data_map = {"Name":["Alice","Bob","Charlie","David"],"Age":[25,30,35,40]}
df = pd.DataFrame(data_map)

mapping = {"Alice":"A","Bob":"B","Charlie":"C","David":"D"}
df["Mapped_Name"] = df["Name"].map(mapping)
df

      Name  Age Mapped_Name
0    Alice   25           A
1      Bob   30           B
2  Charlie   35           C
3    David   40           D

In [117]:
def map_age(age):
    if(age<30):
        return "Young"
    elif(age >= 30 and age < 40):
        return "Middle-aged"
    else:
        return "Senior"

In [118]:
df["Age_Group"] = df["Age"].map(map_age)
df

      Name  Age Mapped_Name    Age_Group
0    Alice   25           A        Young
1      Bob   30           B  Middle-aged
2  Charlie   35           C  Middle-aged
3    David   40           D       Senior

## Concatenate

In [119]:
temp_data = pd.DataFrame({"Date":['12-02-2023','13-02-2023','14-02-2023','15-02-2023','16-02-2023'],'TempMax':[24.3,26.9,23.4,
                                                                                                               15.5,16.1]})
rainfall_data = pd.DataFrame({"Date":['12-02-2023','13-02-2023','14-02-2023','15-02-2023','16-02-2023'],'Rainfall':[0,3.6,3.6,
                                                                                39.8,2.8]})

In [120]:
final_concat = pd.concat([temp_data,rainfall_data],axis=0)
final_concat

         Date  TempMax  Rainfall
0  12-02-2023     24.3       NaN
1  13-02-2023     26.9       NaN
2  14-02-2023     23.4       NaN
3  15-02-2023     15.5       NaN
4  16-02-2023     16.1       NaN
0  12-02-2023      NaN       0.0
1  13-02-2023      NaN       3.6
2  14-02-2023      NaN       3.6
3  15-02-2023      NaN      39.8
4  16-02-2023      NaN       2.8

In [121]:
final_concat = pd.concat([temp_data,rainfall_data],axis=1)
final_concat

         Date  TempMax        Date  Rainfall
0  12-02-2023     24.3  12-02-2023       0.0
1  13-02-2023     26.9  13-02-2023       3.6
2  14-02-2023     23.4  14-02-2023       3.6
3  15-02-2023     15.5  15-02-2023      39.8
4  16-02-2023     16.1  16-02-2023       2.8

In [122]:
final_concat = pd.concat([temp_data,rainfall_data],axis=0,ignore_index=False)
final_concat

         Date  TempMax  Rainfall
0  12-02-2023     24.3       NaN
1  13-02-2023     26.9       NaN
2  14-02-2023     23.4       NaN
3  15-02-2023     15.5       NaN
4  16-02-2023     16.1       NaN
0  12-02-2023      NaN       0.0
1  13-02-2023      NaN       3.6
2  14-02-2023      NaN       3.6
3  15-02-2023      NaN      39.8
4  16-02-2023      NaN       2.8

In [123]:
final_concat = pd.concat([temp_data,rainfall_data],axis=0,ignore_index=True)
final_concat

         Date  TempMax  Rainfall
0  12-02-2023     24.3       NaN
1  13-02-2023     26.9       NaN
2  14-02-2023     23.4       NaN
3  15-02-2023     15.5       NaN
4  16-02-2023     16.1       NaN
5  12-02-2023      NaN       0.0
6  13-02-2023      NaN       3.6
7  14-02-2023      NaN       3.6
8  15-02-2023      NaN      39.8
9  16-02-2023      NaN       2.8

In [124]:
final_concat = pd.concat([temp_data,rainfall_data],axis=0,join="inner")
final_concat

         Date
0  12-02-2023
1  13-02-2023
2  14-02-2023
3  15-02-2023
4  16-02-2023
0  12-02-2023
1  13-02-2023
2  14-02-2023
3  15-02-2023
4  16-02-2023

In [125]:
final_concat = pd.concat([temp_data,rainfall_data],axis=0,join="outer")
final_concat

         Date  TempMax  Rainfall
0  12-02-2023     24.3       NaN
1  13-02-2023     26.9       NaN
2  14-02-2023     23.4       NaN
3  15-02-2023     15.5       NaN
4  16-02-2023     16.1       NaN
0  12-02-2023      NaN       0.0
1  13-02-2023      NaN       3.6
2  14-02-2023      NaN       3.6
3  15-02-2023      NaN      39.8
4  16-02-2023      NaN       2.8

In [126]:
final_concat = pd.concat([temp_data,rainfall_data],keys=("A","B"))
final_concat

           Date  TempMax  Rainfall
A 0  12-02-2023     24.3       NaN
  1  13-02-2023     26.9       NaN
  2  14-02-2023     23.4       NaN
  3  15-02-2023     15.5       NaN
  4  16-02-2023     16.1       NaN
B 0  12-02-2023      NaN       0.0
  1  13-02-2023      NaN       3.6
  2  14-02-2023      NaN       3.6
  3  15-02-2023      NaN      39.8
  4  16-02-2023      NaN       2.8

In [127]:
final_concat.loc["A"]["TempMax"].max()

26.9

In [128]:
final_concat = pd.concat([temp_data,rainfall_data],axis=0,keys=("Chennai","Delhi"))
final_concat

                 Date  TempMax  Rainfall
Chennai 0  12-02-2023     24.3       NaN
        1  13-02-2023     26.9       NaN
        2  14-02-2023     23.4       NaN
        3  15-02-2023     15.5       NaN
        4  16-02-2023     16.1       NaN
Delhi   0  12-02-2023      NaN       0.0
        1  13-02-2023      NaN       3.6
        2  14-02-2023      NaN       3.6
        3  15-02-2023      NaN      39.8
        4  16-02-2023      NaN       2.8

In [129]:
final_concat.loc["Delhi"]

         Date  TempMax  Rainfall
0  12-02-2023      NaN       0.0
1  13-02-2023      NaN       3.6
2  14-02-2023      NaN       3.6
3  15-02-2023      NaN      39.8
4  16-02-2023      NaN       2.8

In [130]:
final_concat.loc["Chennai"]["TempMax"][4]

16.1

In [131]:
final_concat = pd.concat([temp_data,rainfall_data],axis=1,keys="AB")
final_concat

            A                   B
         Date TempMax        Date Rainfall
0  12-02-2023    24.3  12-02-2023      0.0
1  13-02-2023    26.9  13-02-2023      3.6
2  14-02-2023    23.4  14-02-2023      3.6
3  15-02-2023    15.5  15-02-2023     39.8
4  16-02-2023    16.1  16-02-2023      2.8

In [132]:
final_concat["A"]["TempMax"].max()

26.9

In [133]:
data1 = {
    "Name":["Alice","Bob","Charlie"],
    "Age":[25,30,35],
    "Score":[85,90,88]
}

data2 = {
    "Name":["David","Eve","Charlie"],
    "Age":[27,32,35],
    "Score":[82,88,88],
    "Extra":[100,100,100]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [134]:
final_concat = pd.concat([df1,df2],axis=0,join="inner",ignore_index=True)
final_concat

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     88
3    David   27     82
4      Eve   32     88
5  Charlie   35     88

In [135]:
final_concat = pd.concat([df1,df2],axis=1,join="inner",ignore_index=True)
final_concat

         0   1   2        3   4   5    6
0    Alice  25  85    David  27  82  100
1      Bob  30  90      Eve  32  88  100
2  Charlie  35  88  Charlie  35  88  100

In [136]:
final_concat = pd.concat([df1,df2],axis=1,keys=("A","B"))
final_concat

         A                  B
      Name Age Score     Name Age Score Extra
0    Alice  25    85    David  27    82   100
1      Bob  30    90      Eve  32    88   100
2  Charlie  35    88  Charlie  35    88   100

In [137]:
final_concat["A"]["Score"].min()

85

In [138]:
final_concat["B"]["Score"].min()

82

In [139]:
final_concat = pd.concat([df1,df2],axis=0,join="inner")
final_concat

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     88
0    David   27     82
1      Eve   32     88
2  Charlie   35     88

## Compare

In [140]:
df = pd.DataFrame(
    {
    "col1":["a","a","b","b","a"],
    "col2":[1.0,2.0,3.0,np.nan,5],
    "col3":[1,2,3,4,5]
   },
    columns=["col1","col2","col3"]    
)
df

  col1  col2  col3
0    a   1.0     1
1    a   2.0     2
2    b   3.0     3
3    b   NaN     4
4    a   5.0     5

In [141]:
df2 = df.copy()

In [142]:
df.compare(df2)

Empty DataFrame
Columns: []
Index: []

In [143]:
df2.loc[0,"col1"] = "c"
df2.loc[2,"col3"] = 4
df2

  col1  col2  col3
0    c   1.0     1
1    a   2.0     2
2    b   3.0     4
3    b   NaN     4
4    a   5.0     5

In [144]:
df.compare(df2)  # Default align_axis = 1

  col1       col3
  self other self other
0    a     c  NaN   NaN
2  NaN   NaN  3.0   4.0

In [145]:
df.compare(df2,align_axis = 0)

        col1  col3
0 self     a   NaN
  other    c   NaN
2 self   NaN   3.0
  other  NaN   4.0

In [146]:
df3 = df.copy()
df3.loc[0,"col1"] = "c"
df3.loc[1,"col2"] = 100
df3.loc[2,"col3"] = 4
df3

  col1   col2  col3
0    c    1.0     1
1    a  100.0     2
2    b    3.0     4
3    b    NaN     4
4    a    5.0     5

In [147]:
df.compare(df3)

  col1       col2        col3
  self other self  other self other
0    a     c  NaN    NaN  NaN   NaN
1  NaN   NaN  2.0  100.0  NaN   NaN
2  NaN   NaN  NaN    NaN  3.0   4.0

In [148]:
df["col2"].equals(df2["col2"])

True

In [149]:
output = pd.Series(df["col2"] == df2["col2"])
output

0     True
1     True
2     True
3    False
4     True
Name: col2, dtype: bool

In [150]:
df.loc[output]

  col1  col2  col3
0    a   1.0     1
1    a   2.0     2
2    b   3.0     3
4    a   5.0     5

## Pivot Table

In [151]:
data = {
    "Date" : ["2022-01-01","2022-01-01","2022-01-02","2022-01-02"],
    "Category" : ["A","B","A","B"],
    "Value" : [10,20,30,40]
}

df = pd.DataFrame(data)
df

         Date Category  Value
0  2022-01-01        A     10
1  2022-01-01        B     20
2  2022-01-02        A     30
3  2022-01-02        B     40

In [152]:
pivot_table = df.pivot_table(values="Value",index="Date",columns="Category",aggfunc="sum")
pivot_table

Category     A   B
Date
2022-01-01  10  20
2022-01-02  30  40

In [153]:
pivot_table = df.pivot_table(values="Value",index=["Date","Category"],aggfunc="sum")
pivot_table

                     Value
Date       Category
2022-01-01 A            10
           B            20
2022-01-02 A            30
           B            40

In [154]:
data = {}
np.random.seed(2)

for i in [chr(x) for x in range(65,70)]:
    data["col" + i] = np.random.randint(1,100,10)
data["orderID"] = np.random.choice(["A","B","C"],10)
data["product"] = np.random.choice(["Product1","Product2","Product3"],10)
data["customer"] = np.random.choice(["Customer1","Customer2","Customer3","Customer4"],10)

df = pd.DataFrame(data)
df

   colA  colB  colC  colD  colE orderID   product   customer
0    41    96    68    69    51       B  Product2  Customer3
1    16    76     5    47     5       C  Product2  Customer1
2    73    86    43    71    91       B  Product2  Customer1
3    23    48    52    96    64       B  Product3  Customer3
4    44    64    39    84    80       A  Product1  Customer3
5    83    32    34    32    50       B  Product3  Customer1
6    76    91    59    67    40       C  Product3  Customer3
7     8    21    68    81    47       A  Product1  Customer1
8    35    38    70    53     9       C  Product1  Customer2
9    50    40    89    77    51       B  Product3  Customer3

In [155]:
pivot_table = df.pivot_table(values = "colA",index = "orderID",columns = "product",aggfunc = "max")
pivot_table

product  Product1  Product2  Product3
orderID
A            44.0       NaN       NaN
B             NaN      73.0      83.0
C            35.0      16.0      76.0

In [156]:
pivot_table = df.pivot_table(values = "colA",index = ["orderID","customer"],columns = "product",aggfunc = "max")
pivot_table

product            Product1  Product2  Product3
orderID customer
A       Customer1       8.0       NaN       NaN
        Customer3      44.0       NaN       NaN
B       Customer1       NaN      73.0      83.0
        Customer3       NaN      41.0      50.0
C       Customer1       NaN      16.0       NaN
        Customer2      35.0       NaN       NaN
        Customer3       NaN       NaN      76.0

In [157]:
pivot_table = df.pivot_table(values = "colA",index = "orderID",columns = "product",aggfunc = "max",fill_value=0)
pivot_table

product  Product1  Product2  Product3
orderID
A              44         0         0
B               0        73        83
C              35        16        76

In [158]:
pivot_table = df.pivot_table(values = "colA",index = "orderID",columns = "product",aggfunc = "mean",fill_value = 0)
pivot_table

product  Product1  Product2  Product3
orderID
A            26.0       0.0       0.0
B             0.0      57.0      52.0
C            35.0      16.0      76.0

In [159]:
pivot_table = df.pivot_table(values = "colA",index = ["orderID","customer"],columns = "product",aggfunc = "max",fill_value = 0)
pivot_table

product            Product1  Product2  Product3
orderID customer
A       Customer1         8         0         0
        Customer3        44         0         0
B       Customer1         0        73        83
        Customer3         0        41        50
C       Customer1         0        16         0
        Customer2        35         0         0
        Customer3         0         0        76

## Merge and Join

In [160]:
data1 = {
    "ID":[10001,20002,30003,40004,50005],
    "Numbers":[10,20,20,40,50],
    "Letters":["A","B","C","D","E"]
}

df1 = pd.DataFrame(data1)
df1

      ID  Numbers Letters
0  10001       10       A
1  20002       20       B
2  30003       20       C
3  40004       40       D
4  50005       50       E

In [161]:
data2 = {
    "ID":[10001,20002,30003,60006,70007],
    "Numbers":[10,20,30,40,60],
    "City":["Lucknow","Munnar","Chennai","Delhi","Jaipur"]
}

df2 = pd.DataFrame(data2)
df2

      ID  Numbers     City
0  10001       10  Lucknow
1  20002       20   Munnar
2  30003       30  Chennai
3  60006       40    Delhi
4  70007       60   Jaipur

In [162]:
merge_data1 = df1.merge(df2,how="inner")
merge_data1

      ID  Numbers Letters     City
0  10001       10       A  Lucknow
1  20002       20       B   Munnar

In [163]:
merge_data2 = df1.merge(df2,how="inner",on="ID")
merge_data2

      ID  Numbers_x Letters  Numbers_y     City
0  10001         10       A         10  Lucknow
1  20002         20       B         20   Munnar
2  30003         20       C         30  Chennai

In [164]:
merge_data3 = df1.merge(df2,how="outer")
merge_data3

      ID  Numbers Letters     City
0  10001       10       A  Lucknow
1  20002       20       B   Munnar
2  30003       20       C      NaN
3  30003       30     NaN  Chennai
4  40004       40       D      NaN
5  50005       50       E      NaN
6  60006       40     NaN    Delhi
7  70007       60     NaN   Jaipur

In [165]:
merge_data4 = df1.merge(df2,how="outer",on="ID")
merge_data4

      ID  Numbers_x Letters  Numbers_y     City
0  10001       10.0       A       10.0  Lucknow
1  20002       20.0       B       20.0   Munnar
2  30003       20.0       C       30.0  Chennai
3  40004       40.0       D        NaN      NaN
4  50005       50.0       E        NaN      NaN
5  60006        NaN     NaN       40.0    Delhi
6  70007        NaN     NaN       60.0   Jaipur

In [166]:
left_merge = pd.merge(df1,df2,how="left")
left_merge

      ID  Numbers Letters     City
0  10001       10       A  Lucknow
1  20002       20       B   Munnar
2  30003       20       C      NaN
3  40004       40       D      NaN
4  50005       50       E      NaN

In [167]:
right_merge = pd.merge(df1,df2,how="right")
right_merge

      ID  Numbers Letters     City
0  10001       10       A  Lucknow
1  20002       20       B   Munnar
2  30003       30     NaN  Chennai
3  60006       40     NaN    Delhi
4  70007       60     NaN   Jaipur

In [168]:
cross_merge = df1.merge(df2,how="cross")
cross_merge

     ID_x  Numbers_x Letters   ID_y  Numbers_y     City
0   10001         10       A  10001         10  Lucknow
1   10001         10       A  20002         20   Munnar
2   10001         10       A  30003         30  Chennai
3   10001         10       A  60006         40    Delhi
4   10001         10       A  70007         60   Jaipur
5   20002         20       B  10001         10  Lucknow
6   20002         20       B  20002         20   Munnar
7   20002         20       B  30003         30  Chennai
8   20002         20       B  60006         40    Delhi
9   20002         20       B  70007         60   Jaipur
10  30003         20       C  10001         10  Lucknow
11  30003         20       C  20002         20   Munnar
12  30003         20       C  30003         30  Chennai
13  30003         20       C  60006         40    Delhi
14  30003         20       C  70007         60   Jaipur
15  40004         40       D  10001         10  Lucknow
16  40004         40       D  20002         20   Munnar
17  40004         40       D  30003         30  Chennai
18  40004         40       D  60006         40    Delhi
19  40004         40       D  70007         60   Jaipur
20  50005         50       E  10001         10  Lucknow
21  50005         50       E  20002         20   Munnar
22  50005         50       E  30003         30  Chennai
23  50005         50       E  60006         40    Delhi
24  50005         50       E  70007         60   Jaipur

In [169]:
np.random.seed(42)
temp_data = pd.DataFrame({'Date': pd.date_range(start='2023-02-1', end='2023-02-28').strftime('%d-%m-%Y'),
                    'TempMax': np.random.uniform(16,30, size=28) })

rainfall_data = pd.DataFrame({'Date': ['12-02-2023', '15-02-2023', '16-02-2023', '18-02-2023', '20-02-2023'],
                    'Rainfall': [0, 3.6, 3.6, 39.8, 2.8 ] })

In [170]:
merge_data = rainfall_data.merge(temp_data,how="inner",on="Date")
merge_data

         Date  Rainfall    TempMax
0  12-02-2023       0.0  29.578738
1  15-02-2023       3.6  18.545550
2  16-02-2023       3.6  18.567663
3  18-02-2023      39.8  23.346590
4  20-02-2023       2.8  20.077208

In [171]:
merge_data = temp_data.merge(rainfall_data,how="outer")
merge_data

          Date    TempMax  Rainfall
0   01-02-2023  21.243562       NaN
1   02-02-2023  29.310000       NaN
2   03-02-2023  26.247915       NaN
3   04-02-2023  24.381219       NaN
4   05-02-2023  18.184261       NaN
5   06-02-2023  18.183923       NaN
6   07-02-2023  16.813171       NaN
7   08-02-2023  28.126466       NaN
8   09-02-2023  24.415610       NaN
9   10-02-2023  25.913016       NaN
10  11-02-2023  16.288183       NaN
11  12-02-2023  29.578738       0.0
12  13-02-2023  27.654197       NaN
13  14-02-2023  18.972748       NaN
14  15-02-2023  18.545550       3.6
15  16-02-2023  18.567663       3.6
16  17-02-2023  20.259391       NaN
17  18-02-2023  23.346590      39.8
18  19-02-2023  22.047230       NaN
19  20-02-2023  20.077208       2.8
20  21-02-2023  24.565941       NaN
21  22-02-2023  17.952914       NaN
22  23-02-2023  20.090025       NaN
23  24-02-2023  21.129066       NaN
24  25-02-2023  22.384980       NaN
25  26-02-2023  26.992463       NaN
26  27-02-2023  18.795433       NaN
27  28-02-2023  23.199282       NaN

## Question1

MetaData
Airline:The name of the airline 
* Source: The source from which the service begins 
* Destination: The destination where the service ends 
* Route: Route the flight took. 
* Dep_Time: The time when the journey starts from the source. 
* Arrival_Time: Time of arrival at the destination. 
* Duration: Total duration of the flight. 
* Total_Stops: Total stops between the source and destination. 
* Additional_Info: Additional information about the flight 
* Price: The price of the ticket â–¶â–¶â–¶ Target 
* Month: Month of journey. 
* WeekDay: Day at which journey started. 
* Day: Date of the start of journey.

In [172]:
flight = pd.read_csv("flight.csv")

In [173]:
# 1 What is the average of the flight ticket price? Write your answer correct to two decimal places.

flight["Price"].mean(axis=0).round(2)

9027.9

In [174]:
# 2 During which month did the highest number of flights occur? Months are represented by numerical codes, with January 
# corresponding to 1, February to 2, and so forth.

flight["Month"].value_counts().sort_values(ascending=False)

Month
5    3092
6    3044
3    2388
4     926
Name: count, dtype: int64

In [175]:
# 3 Is the average price of flight tickets higher on weekends (Saturday and Sunday) or on weekdays (Remaining 5 days)?

flight[(flight["WeekDay"] == "Saturday") | (flight["WeekDay"] == "Sunday")]["Price"].mean(axis=0) > flight[~((flight["WeekDay"] == "Saturday") | (flight["WeekDay"] == "Sunday"))]["Price"].mean(axis=0)

True

In [176]:
# 4 Two of the entries in the 'Additional_Info' column are 'No info' and 'No Info'. Replace all occurrences of 'No Info' with 
# 'No info'. How many flights fall under airline 'IndiGo' and have 'No info' as additional information?

flight.loc[flight["Additional_Info"] == "No Info","Additional_Info"] = "No info"
flight[(flight["Airline"] == "IndiGo") & (flight["Additional_Info"]=="No info")].shape[0]

1650

In [177]:
# 5 Convert the values of 'Duration' into seconds. Enter the average duration (in seconds) of a flight. Enter your answer 
# correct to two decimal places.

def duration_second(time):
    sec = 0
    time = time.split(" ")
    for i in range(len(time)):
        if("h" in time[i]):
            sec += int(time[i][:-1]) * 3600
        if("m" in time[i]):
            sec += int(time[i][:-1]) * 60 
    return sec

flight["duration_second"] = flight["Duration"].apply(duration_second)
flight["duration_second"].mean(axis=0)

38957.93650793651

In [178]:
# 6 Apply the following functions to the columns Dep_Time and Arrival_Time:
# Transform the values in the 'dep_time' and 'arrival_time' columns to represent the hour component. For instance, if an entry 
# is 10:05 June 13 or 10:05, the corresponding value should be 10. 
# Then convert the time into four categories as follows:
# 5 <= hour < 12 = Morning 
# 12 <= hour < 17 = Afternoon 
# 17 <= hour < 20 = Evening 
# 20 <= hour < 5 = Night
# Note: Please ensure that you make the changes directly within the dataset and continue to use that modified dataset for 
# subsequent questions.

# How many flights started in the Morning and arrived the destination at Evening?

def shift(time):
    a = int(time.split(":")[0])
    if(a >= 5 and a < 12):
        return "Morning"
    if(a >= 12 and a < 17):
        return "Afternoon"
    if(a >= 17 and a < 20):
        return "Evening"
    if(a >= 20 or a <=5):
        return "Night"
    

flight["departure_shift"] = flight["Dep_Time"].apply(shift)
flight["arrival_shift"] = flight["Arrival_Time"].apply(shift)
flight[(flight["departure_shift"] == "Morning") & (flight["arrival_shift"] == "Evening")].shape[0]

922

In [179]:
# 7 Encode the values of column 'WeekDay' as follows:
# Weekends (Sunday, Saturday) = 1
# all remaining five days = 0
# What is the most frequent (mode) WeekDay?

flight.loc[flight["WeekDay"].isin(["Saturday","Sunday"]),"WeekDay"] = 1
flight.loc[~(flight["WeekDay"] == 1),"WeekDay"] = 0

flight["WeekDay"].value_counts().sort_values(ascending=False)

WeekDay
0    6651
1    2799
Name: count, dtype: int64

## Question2

In [180]:
house = pd.read_csv("house.csv")

In [181]:
# 1 How many unknown ("?) values are present in the dataset? Remove/Delete unknown ("?) values present in the dataset to make 
# it null value.
# Remove/Delete - means it will show NAN in place of "?"
# Note: If there is no value present in the dataset it is represented as NAN(read pandas documentation for all the other ways 
# to represent null values) in data

(house == "?").sum().sum()
house.replace("?",np.nan,inplace=True)

In [182]:
# 2 What is the shape of the dataset ?

house.shape

(10000, 12)

In [183]:
# 3 What is the value present at the 692th indexed row and 0th indexed column in the data ?
# dataframe[692,0] (simply saying this in a matrix)
# rows/ columns starts indexing from zero(0) in python

house.iloc[692,0]

'2009-11-16'

In [184]:
# 4 What is the value present at the 546th indexed row and 7th indexed column in the data ?
#  dataframe[546,7] (simply saying this in a matrix)
#  rows/ columns starts indexing from zero(0) in python

house.iloc[546,7]

3

In [185]:
# 5 What are the unique values present in the Locality feature of the dataset?

house["Locality"].unique()

array(['Waterbury', 'Bridgeport', 'Greenwich', 'Norwalk', nan,
       'Fairfield', 'West Hartford', 'Stamford'], dtype=object)

In [186]:
# 6 Which of the following features have missing(NaN) values present in the dataset?
# (Note: compute after removing "?")

house.isnull().sum()

Date                    0
Year                    0
Locality             1253
Estimated Value      1243
Sale Price              0
Property             1823
Residential             0
num_rooms               0
num_bathrooms           0
carpet_area          1229
property_tax_rate       0
Face                    0
dtype: int64

In [187]:
# 7 Which of the following feature has most missing(NaN) values present in the dataset?
#  (Note: compute after removing "?") 

house.isnull().sum().sort_values(ascending=False)

Property             1823
Locality             1253
Estimated Value      1243
carpet_area          1229
Date                    0
Year                    0
Sale Price              0
Residential             0
num_rooms               0
num_bathrooms           0
property_tax_rate       0
Face                    0
dtype: int64

In [188]:
# 8 Drop all the samples(rows) with missing values strictly greater than 2. How many samples remains after that ?
# (Note: compute after removing "?") 

house.drop(index = house[house.isnull().sum(axis = 1) >  2].index,inplace=True)
house.shape[0]

9917

In [189]:
# 9 Drop all the samples(rows) with missing values in the original dataframe. How many samples remains after that ?
# (Note: compute after removing "?") 

house.drop(index = house[house.isnull().sum(axis=1) > 0].index,inplace=True)
house.shape[0]

5449

## Question3

In [190]:
house = pd.read_csv("house1.csv")

In [191]:
# 1 Select all the even indexed rows from the given dataset. What is the value in the 3rd indexed column of the 0th indexed row
# in the selected dataframe. (row/ column indexed from zero(0) in python/pandas)

house[house.index % 2 == 0].reset_index(drop=True).iloc[0,3]

111440.0

In [192]:
# 2 Select all the even indexed rows from the given dataset. What is the value in the 3rd indexed column of the 332th indexed 
# row in the selected dataframe. (row/ column indexed from zero(0))

house[house.index % 2 == 0].reset_index(drop=True).iloc[332,3]

256200.0

In [193]:
# 3 Select all the odd indexed rows from the given dataset. What is the value in the 3rd indexed column of the 332th indexed 
# row in the selected dataframe. (row/ column indexed from zero(0))
#  Please consider case sensitivity while giving your solution capital letter â‰  small letter
#  If it is a string don't write quotes in the solution.

house[house.index % 2 == 1].reset_index(drop = True).iloc[332,3]

352940.0

In [194]:
# 4 Select all the odd indexed columns from the given dataset. What is the value in the 5th indexed column of the 100th indexed
# row in the selected dataframe. (row/ column indexed from zero(0))
# Please consider case sensitivity while giving your solution capital letter â‰  small letter
# If it is a string don't write quotes in the solution.

house.iloc[:,1::2].iloc[100,5]

'West'

In [195]:
# 5 Select all the even indexed columns and even indexed rows from the given dataset. What is the value in the 3th indexed 
# column of the 255th indexed row in the selected dataframe. (row/ column indexed/starts from zero(0))
# Please consider case sensitivity while giving your solution capital letter â‰  small letter
# If it is a string don't write quotes in the solution.

house.iloc[::2,::2].reset_index(drop=True).iloc[255,3]

'Detached House'

In [196]:
# 6 Determine the number of samples (rows) in the dataset that belong to the six most recent years, based on the provided data.

house["Year"].value_counts().sort_index(ascending = False).iloc[0:6].sum()

4749

In [197]:
# 7 Determine the number of samples (rows) in the dataset which has num_rooms = 3 and num_bathrooms = 3

house[(house["num_rooms"] == 3) & (house["num_bathrooms"] == 3)].shape[0]

2730

In [198]:
# 8 Determine the number of samples (rows) in the dataset which has num_rooms = 3 or num_bathrooms = 3

house[(house["num_rooms"] == 3) | (house["num_bathrooms"] == 3)].shape[0]

8591

In [199]:
# 9 In the Year 2022, how many houses (rows) located in the Greenwich Locality have exactly num_room == 3, and facing towards 
# either the North or East?

temp = house[(house["Year"] == 2022) & (house["Locality"] == "Greenwich")]
temp[(temp["num_rooms"] == 3) & (temp["Face"].isin(["North","East"]))].shape[0]

42

In [200]:
# 10 Calculate the number of samples(rows) that correspond to the month of August across all the years.?

def month(date):
    date = date.split("-")
    
    if(int(date[1]) == 8):
        return 1
    else:
        return 0
    
house["Month"] = house["Date"].apply(month)
house[house["Month"] == 1].shape[0]

1050

In [201]:
# 11 According to the data which Locality have highest average Sale Price?

house.groupby("Locality")["Sale Price"].agg("mean").sort_values(ascending = False)

Locality
Greenwich        2.270224e+06
Fairfield        7.277225e+05
Stamford         6.305313e+05
Norwalk          5.590959e+05
West Hartford    3.385472e+05
Bridgeport       1.740953e+05
Waterbury        1.062152e+05
Name: Sale Price, dtype: float64

## Question4

In [202]:
rating = pd.read_csv("ratings.csv")
books = pd.read_csv("books.csv")
book_tag = pd.read_csv("book_tags.csv")
read = pd.read_csv("toread.csv")

In [203]:
# Q1 : Which book (title) has the minimum (average_rating) [books.csv], if more than 1 book have same average rating, sort the 
# books by ['title'] in alphabetical order and use the first book in the sorted list? (S)

books[books["average_rating"] == books["average_rating"].min()]["title"]

627    The Almost Moon
Name: title, dtype: object

In [204]:
# Q2 : Which (tag_id) is the most frequently used ie. mapped with the highest number of books [book_tags.csv] ? (In case of more 
# than one tag, mention the tag id with the least numerical value) (N)

df = book_tag.groupby("tag_id")["goodreads_book_id"].agg("count")
df.sort_values(ascending=False).head(1).index[0]

22352

In [205]:
# Q3 : How many books do not have an original title [books.csv] ? (N)

books["original_title"].isnull().sum()

54

In [206]:
# Q4 : Which book (title) has the maximum number of ratings based on (work_ratings_count) [books.csv] ? (S)

books[books["work_ratings_count"] == books["work_ratings_count"].max()]["title"].values

array(["Harry Potter and the Sorcerer's Stone (Harry Potter, #1)"],
      dtype=object)

In [207]:
# Q5 : Which is the least used tag, i.e. mapped with the lowest number of books [book_tags.csv]? (In case of more than one tag, 
# mention the tag id with the least numerical value) (N)

df = book_tag.groupby("tag_id")["goodreads_book_id"].agg("count")
df.sort_values().index[0]

0

In [208]:
# Q6 : What is the mean value of rating of all the books in the dataset based on (average_rating) [books.csv] ? (F)

round(books["average_rating"].mean(),2)

3.98

In [209]:
# Q7 : Which book (goodreads_book_id) has the least number of count of tags given by the user ie. the book with minimum user 
# records including all tags [book_tags.csv] ? (N)

df = book_tag.groupby("goodreads_book_id")["count"].agg("sum")
df.sort_values().index[0]

13545345

In [210]:
# Q8 : How many unique users are present in the dataset [ratings.csv] ? (N)

len(rating["user_id"].unique())

53323

In [211]:
# Q9 : How many unique tags are there in the dataset [book_tags.csv] ? (N)

len(book_tag["tag_id"].unique())

8789

In [212]:
# Q10 : Predict sentiment using Textblob. How many positive titles (original_title) are there [books.csv] ? (cut-off >=0) N

df = pd.DataFrame({"original_title":books[books["original_title"].notnull()]["original_title"]})
df["Subjectivity"] = df["original_title"].apply(lambda x : TextBlob(x).sentiment.subjectivity)
df["Polarity"] = df["original_title"].apply(lambda x : TextBlob(x).sentiment.polarity)

df["Sentiment"] = df["Polarity"].apply(lambda x : "Negative" if x<0 else "Positive")
len(df[df["Sentiment"] == "Positive"])

1167

## Getting and Knowing your Data

## Question 5a

In [213]:
# 1 Import the dataset from this https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv
# Assign it to a variable called chipo.

chipo = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv",sep="\t")
chipo

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [214]:
# 2 See the first 10 entries

chipo.head(n = 10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [215]:
# 3 What is the number of observations in the dataset?

chipo.shape[0]

4622

In [216]:
# 4 What is the number of columns in the dataset?

chipo.shape[1]

5

In [217]:
# 5 Print the name of all the columns.

chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [218]:
# 6 How is the dataset indexed?

chipo.index

RangeIndex(start=0, stop=4622, step=1)

In [219]:
# 7 Which was the most-ordered item?

chipo.groupby("item_name")["quantity"].sum().sort_values(ascending=False).head(1)
# chipo.groupby("item_name").sum().sort_values(["quantity"],ascending=False).head(1)

item_name
Chicken Bowl    761
Name: quantity, dtype: int64

In [220]:
# 8 For the most-ordered item, how many items were ordered?

chipo.groupby("item_name")["quantity"].sum().sort_values(ascending=False).head(n = 1).values[0]

761

In [221]:
# 9 What was the most ordered item in the choice_description column?

chipo.groupby("choice_description").sum().sort_values(["quantity"],ascending=False).head(1)

,order_id,quantity,item_name,item_price
choice_description,,,,
[Diet Coke],123455,159,Canned SodaCanned SodaCanned Soda6 Pack Soft D...,$2.18 $1.09 $1.09 $6.49 $2.18 $1.25 $1.09 $6.4...

In [222]:
# 10 How many items were orderd in total?

chipo["quantity"].sum()

4972

In [223]:
# 11 Turn the item price into a float

dollarizer = lambda x : float(x[1:-1])
chipo["item_price"] = chipo["item_price"].apply(dollarizer)
chipo["item_price"].dtype

dtype('float64')

In [224]:
# 12 How much was the revenue for the period in the dataset?

revenue = (chipo["quantity"] * chipo["item_price"]).sum()
revenue

39237.02

In [225]:
# 13 How many orders were made in the period?

order = chipo["order_id"].value_counts().count()
order

1834

In [226]:
# 14 What is the average revenue amount per order?

average_revenue = revenue / order
average_revenue

21.39423118865867

In [227]:
# 15 How many different items are sold?

chipo["item_name"].value_counts().count()

50

## Question 5b

In [228]:
# 1 Import the dataset from this https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user.Assign it to a variable 
# called users and use the 'user_id' as index

users = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",sep="|",index_col="user_id")

In [229]:
# 2 See the first 25 entries

users.head(n = 25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [230]:
# 3 See the last 10 entries

df.tail(n = 10)

,original_title,Subjectivity,Polarity,Sentiment
1299,Divine Madness,0.000000,0.000000,Positive
1300,Such a Rush,0.500000,0.000000,Positive
1301,"Blue Noon (Midnighters, #3)",0.100000,0.000000,Positive
1302,Hidden,0.333333,-0.166667,Negative
1303,Thank You for Smoking,0.000000,0.000000,Positive
1304,Thirteen Moons,0.000000,0.000000,Positive
1305,The Bridge Across Forever: A True Love Story,0.625000,0.425000,Positive
1306,Magonia,0.000000,0.000000,Positive
1307,The Mime Order,0.000000,0.000000,Positive
1308,Bagombo Snuff Box,0.000000,0.000000,Positive

In [231]:
# 4 What is the number of observations in the dataset?

users.shape[0]

943

In [232]:
# 5 What is the number of columns in the dataset?

users.shape[1]

4

In [233]:
# 6 Print the name of all the columns.

users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [234]:
# 7 How is the dataset indexed?

users.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

In [235]:
# 8 What is the data type of each column?

users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [236]:
# 9 Print only the occupation column

users["occupation"]

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [237]:
# 10 How many different occupations are in this dataset?

users["occupation"].nunique()

21

In [238]:
# 11 What is the most frequent occupation?

users["occupation"].value_counts().sort_values(ascending = False).head(1).index[0]

'student'

In [239]:
# 12 Summarize the DataFrame.

users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [240]:
# 13 Summarize all the columns

users.describe(include = "all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [241]:
# 14 Summarize only the occupation column

users["occupation"].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [242]:
# 15 What is the mean age of users?

np.round(users["age"].mean(),2)

34.05

In [243]:
# 16 What is the age with least occurrence?

users["age"].value_counts().tail()

age
7     1
66    1
11    1
10    1
73    1
Name: count, dtype: int64

## Question 5c

In [244]:
# 1 Use the tsv file and assign it to a dataframe called food

food = pd.read_csv("food.tsv",sep="\t")

C:\Users\ASUS\AppData\Local\Temp\ipykernel_12960\4146839227.py:3: DtypeWarning: Columns (0,3,5,19,20,24,25,26,27,28,36,37,38,39,48) have mixed types. Specify dtype option on import or set low_memory=False.
  food = pd.read_csv("food.tsv",sep="\t")

In [245]:
# 2 See the first 5 entries

food.head()

,code,url,creator,created_t,created_datetime,last_modified_t,last_modified_datetime,product_name,generic_name,quantity,...,fruits-vegetables-nuts_100g,fruits-vegetables-nuts-estimate_100g,collagen-meat-protein-ratio_100g,cocoa_100g,chlorophyl_100g,carbon-footprint_100g,nutrition-score-fr_100g,nutrition-score-uk_100g,glycemic-index_100g,water-hardness_100g
0,3087,http://world-en.openfoodfacts.org/product/0000...,openfoodfacts-contributors,1474103866,2016-09-17T09:17:46Z,1474103893,2016-09-17T09:18:13Z,Farine de blÃ© noir,NaN,1kg,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,4530,http://world-en.openfoodfacts.org/product/0000...,usda-ndb-import,1489069957,2017-03-09T14:32:37Z,1489069957,2017-03-09T14:32:37Z,Banana Chips Sweetened (Whole),NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,14.0,14.0,NaN,NaN
2,4559,http://world-en.openfoodfacts.org/product/0000...,usda-ndb-import,1489069957,2017-03-09T14:32:37Z,1489069957,2017-03-09T14:32:37Z,Peanuts,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN
3,16087,http://world-en.openfoodfacts.org/product/0000...,usda-ndb-import,1489055731,2017-03-09T10:35:31Z,1489055731,2017-03-09T10:35:31Z,Organic Salted Nut Mix,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,12.0,NaN,NaN
4,16094,http://world-en.openfoodfacts.org/product/0000...,usda-ndb-import,1489055653,2017-03-09T10:34:13Z,1489055653,2017-03-09T10:34:13Z,Organic Polenta,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [246]:
# 3 What is the number of observations in the dataset?

food.shape[0]

356027

In [247]:
# 4 What is the number of columns in the dataset?

food.shape[1]

163

In [248]:
# 5 Print the name of all the columns.

food.columns

Index(['code', 'url', 'creator', 'created_t', 'created_datetime',
       'last_modified_t', 'last_modified_datetime', 'product_name',
       'generic_name', 'quantity',
       ...
       'fruits-vegetables-nuts_100g', 'fruits-vegetables-nuts-estimate_100g',
       'collagen-meat-protein-ratio_100g', 'cocoa_100g', 'chlorophyl_100g',
       'carbon-footprint_100g', 'nutrition-score-fr_100g',
       'nutrition-score-uk_100g', 'glycemic-index_100g',
       'water-hardness_100g'],
      dtype='object', length=163)

In [249]:
# 6 What is the name of 105th column?

food.columns[105]

'-fructose_100g'

In [250]:
# 7 What is the type of the observations of the 105th column?

food.dtypes[105]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_12960\3430787833.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  food.dtypes[105]

dtype('float64')

In [251]:
# 8 How is the dataset indexed?

food.index

RangeIndex(start=0, stop=356027, step=1)

In [252]:
# 9 What is the product name of the 19th observation?

food.loc[18,"product_name"]

'Lotus Organic Brown Jasmine Rice'